session1/cours/java_collections.org
# -*- mode: org; org-confirm-babel-evaluate: nil; org-babel-noweb-wrap-start: "«"; org-babel-noweb-wrap-end: "»"; ispell-local-dictionary: "fr_FR";-*-

#+TITLE: Les collections en Java
#+AUTHOR: Bernard Hugueney

#+LANGUAGE: fr
#+LANG: fr
#+HTML_HEAD_EXTRA: <style>*{font-family: monospace !important}</style>

#+BEGIN_SRC elisp :exports none :results silent
 (setq org-ditaa-jar-path "/usr/share/ditaa/ditaa.jar")
(org-babel-do-load-languages
 'org-babel-load-languages
 '((ditaa . t)
   (java . t)
   (python . t)))
#+END_SRC
* Limites des tableaux

Si l'on peut tout faire avec les types primitifs et des tableaux comme
"briques de base", certaines fonctionnalités nécessitent une
implémentation non triviales pour être performantes.

- Exercice :: Proposer un algorithme, voire une implémentation, pour
              stocker un nombre indéterminé à priori d'éléments (par
              exemple les lignes d'un fichier). Que penser de son
              efficacité ?


La bibliothèque standard met à notre disposition, dans le /package/
src_java[:exports code]{java.util} des classes qui implémentent les
principales /structures de données/ qui permettent de gérer
efficacement des principaux cas d'utilisations.

* Introduction aux classes génériques

Les classes implémentant les structures de données sont différentes
des classes comme src_java[:exports code]{String} ou src_java[:exports
code]{Scanner}. En effet, elles sont /paramétrées/ par un(ou plus) nom
de classe. Par exemple : src_java[:exports code]{ArrayList<String>}.

Il s'agit de [[https://en.wikipedia.org/wiki/Generics_in_Java][classes génériques]].

