session1/cours/java_collections.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2019-10-10 Thu 01:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Les collections en Java</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Bernard Hugueney" />
</head>
<body>
<div id="content">
<h1 class="title">Les collections en Java</h1>
<div id="table-of-contents">
<h2>Table des matières</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org888ed59">1. Limites des tableaux</a></li>
<li><a href="#org1c31925">2. Introduction aux classes génériques</a>
<ul>
<li><a href="#org1600358">2.1. Pourquoi des classes génériques ?</a></li>
<li><a href="#org9e96555">2.2. Les classes 'wrappers'</a></li>
</ul>
</li>
<li><a href="#org611519e">3. Stocker un nombre indéterminé d'éléments</a>
<ul>
<li><a href="#org65423a6">3.1. Listes</a></li>
<li><a href="#org978b657">3.2. Piles (<i>Stack</i>)</a></li>
<li><a href="#org9dd0b02">3.3. Files (<i>Queues</i>)</a></li>
</ul>
</li>
<li><a href="#orgba0014c">4. Stocker et rechercher des valeurs sans doublons</a></li>
<li><a href="#org84d9698">5. Associer des valeurs à des clés</a></li>
<li><a href="#orge8e840d">6. Implémenter des classes qui peuvent être utilisées dans des Collections</a>
<ul>
<li><a href="#org9f82f11">6.1. equals</a></li>
<li><a href="#orgfd92853">6.2. hashCode</a></li>
<li><a href="#org8d184b3">6.3. Interface Comparable ou objet Comparator</a></li>
</ul>
</li>
<li><a href="#org2f00c4f">7. Interfaces</a>
<ul>
<li><a href="#org9201984">7.1. List</a></li>
<li><a href="#org8e8794a">7.2. Set</a></li>
<li><a href="#orgc10485f">7.3. Map</a></li>
<li><a href="#org3faaa12">7.4. Collection</a></li>
</ul>
</li>
<li><a href="#org2847749">8. Webliographie</a></li>
</ul>
</div>
</div>

<div id="outline-container-org888ed59" class="outline-2">
<h2 id="org888ed59"><span class="section-number-2">1</span> Limites des tableaux</h2>
<div class="outline-text-2" id="text-1">
<p>
Si l'on peut tout faire avec les types primitifs et des tableaux comme
"briques de base", certaines fonctionnalités nécessitent une
implémentation non triviales pour être performantes.
</p>

<dl class="org-dl">
<dt>Exercice</dt><dd>Proposer un algorithme, voire une implémentation, pour
stocker un nombre indéterminé à priori d'éléments (par
exemple les lignes d'un fichier). Que penser de son
efficacité ?</dd>
</dl>


<p>
La bibliothèque standard met à notre disposition, dans le <i>package</i>
<code class="src src-java">java.util</code> des classes qui implémentent les
principales <i>structures de données</i> qui permettent de gérer
efficacement des principaux cas d'utilisations.
</p>
</div>
</div>

<div id="outline-container-org1c31925" class="outline-2">
<h2 id="org1c31925"><span class="section-number-2">2</span> Introduction aux classes génériques</h2>
<div class="outline-text-2" id="text-2">
<p>
Les classes implémentant les structures de données sont différentes
des classes comme <code class="src src-java">String</code> ou <code class="src src-java">Scanner</code>. En effet, elles sont <i>paramétrées</i> par un(ou plus) nom
de classe. Par exemple : <code class="src src-java"><span style="color: #6434A3;">ArrayList</span>&lt;<span style="color: #6434A3;">String</span>&gt;</code>.
</p>

<p>
Il s'agit de <a href="https://en.wikipedia.org/wiki/Generics_in_Java">classes génériques</a>.
</p>
</div>
