session1/cours/java_collections.org
** Pourquoi des classes génériques ?

En fait, on pourrait stocker des objets de n'importe quel type
(n'importe quelle classe) car tous les objets peuvent être considérés
comme des instances de la classe [[https://docs.oracle.com/javase/8/docs/api/java/lang/Object.html][Object]] [fn:: car toutes les classes
en Java [[https://fr.wikipedia.org/wiki/H%25C3%25A9ritage_(informatique)][héritent]] (cf.POO) de la classe src_java[:exports code]{Object}.].

De telles structures de données permettraient d'avoir des collections
/hétérogènes/, mais surtout ne permettraient pas d'assurer que des
collections sont /homogènes/, ce qui est le cas le plus fréquent,
perdant l'intérêt du typage statique. C'est en essayant d'utiliser une
valeur récupérée dans une collection qu'on aurait une erreur à
l'exécution, alors qu'on aurait voulu avoir une erreur de compilation
à l'insertion puisque c'est là qu'était l'erreur.

#+caption: <<ref:src-HeterogenousContainerError>> Erreur avec une collection hétérogène
#+BEGIN_SRC java -r -l "(ref:%s)" -n :classname HeterogenousContainerError :results raw :exports both
import java.util.ArrayList;

public class HeterogenousContainerError{
    static ArrayList data = new ArrayList();

    public static void main(String[] args){
	try {
	    createData(true);
	    createData(true);
	    createData(false);
	    createData(true);
	    
	    useData();
	    useData();
	    useData();
	}catch(Exception e){
	    e.printStackTrace(System.out);
	}
    }
    public static void createData(boolean valid){
	data.add( valid ? 1 : "1");(ref:autoboxing)
    }
    public static int useData(){
	int res = ((Integer)data.get(data.size()-1))*2; (ref:no-autounboxing)
	data.remove(data.size()-1);
	return res;
    }
}
#+END_SRC

#+RESULTS:
java.lang.ClassCastException: java.lang.String cannot be cast to java.lang.Integer
	at HeterogenousContainerError.useData(HeterogenousContainerError.java:24)
	at HeterogenousContainerError.main(HeterogenousContainerError.java:14)


** Les classes 'wrappers'

On vient de voir que les classes implémentant les structures de
données permettent de stocker n'importe quel /objet/. Mais on peut
vouloir stocker des valeurs de types primitifs. Pour chaque type
primitif, Java met à disposition une [[https://en.wikipedia.org/wiki/Primitive_wrapper_class][classe wrapper]] qui permet, [[https://docs.oracle.com/javase/tutorial/java/data/numberclasses.html][entre
autres]], de stocker la valeur de type primitif à l'intérieur d'un
objet. Par exemple, on a vu la classe [[https://docs.oracle.com/javase/8/docs/api/java/lang/Integer.html][Integer]] (plus précisément
src_java[:exports code]{java.lang.Integer}) qui correspond au type
primitf src_java[:exports code]{int}.

- Exercice :: Trouver les classes correspondant aux autres types
              primitifs.



Ces classes permettent les conversions automatique depuis/vers les
types primitifs ([[https://docs.oracle.com/javase/tutorial/java/data/autoboxing.html][autoboxing / unboxing]]), comme par exemple à la ligne
 [[(autoboxing)]]  du [[ref:src-HeterogenousContainerError][HeterogenousContainerError.java]].

- Exercice :: Comprendre pourquoi il n'y a pas d'auto-unboxing à la
              ligne  [[(no-autounboxing)]] .

* Stocker un nombre indéterminé d'éléments

Lorsqu'on veut stocker un nombre a priori indéterminé de valeurs, suivant qu'on s'intéresse à pouvoir efficacement :
- ajouter des valeurs
- ajouter et retirer des valeurs :
  - En retirant d'abord la dernière valeur ajoutée
  - En retirant d'abord la première valeur ajoutée


Ces trois cas d'utilisation correspondent à différentes classes de la
bibliothèque standard.
