session1/cours/java_collections.html

<div id="outline-container-org1600358" class="outline-3">
<h3 id="org1600358"><span class="section-number-3">2.1</span> Pourquoi des classes génériques ?</h3>
<div class="outline-text-3" id="text-2-1">
<p>
En fait, on pourrait stocker des objets de n'importe quel type
(n'importe quelle classe) car tous les objets peuvent être considérés
comme des instances de la classe <a href="https://docs.oracle.com/javase/8/docs/api/java/lang/Object.html">Object</a> <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>.
</p>

<p>
De telles structures de données permettraient d'avoir des collections
<i>hétérogènes</i>, mais surtout ne permettraient pas d'assurer que des
collections sont <i>homogènes</i>, ce qui est le cas le plus fréquent,
perdant l'intérêt du typage statique. C'est en essayant d'utiliser une
valeur récupérée dans une collection qu'on aurait une erreur à
l'exécution, alors qu'on aurait voulu avoir une erreur de compilation
à l'insertion puisque c'est là qu'était l'erreur.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Programme&nbsp;1&nbsp;: </span><a id="org717d9eb"></a> Erreur avec une collection hétérogène</label><pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #6434A3;">ArrayList</span>;
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">HeterogenousContainerError</span>{
<span class="linenr"> 4: </span>    <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">ArrayList</span> <span style="color: #BA36A5;">data</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">ArrayList</span>();
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">main</span>(<span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">args</span>){
<span class="linenr"> 7: </span>        <span style="color: #0000FF;">try</span> {
<span class="linenr"> 8: </span>            createData(<span style="color: #D0372D;">true</span>);
<span class="linenr"> 9: </span>            createData(<span style="color: #D0372D;">true</span>);
<span class="linenr">10: </span>            createData(<span style="color: #D0372D;">false</span>);
<span class="linenr">11: </span>            createData(<span style="color: #D0372D;">true</span>);
<span class="linenr">12: </span>            
<span class="linenr">13: </span>            useData();
<span class="linenr">14: </span>            useData();
<span class="linenr">15: </span>            useData();
<span class="linenr">16: </span>        }<span style="color: #0000FF;">catch</span>(<span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">e</span>){
<span class="linenr">17: </span>            e.printStackTrace(System.out);
<span class="linenr">18: </span>        }
<span class="linenr">19: </span>    }
<span class="linenr">20: </span>    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">createData</span>(<span style="color: #6434A3;">boolean</span> <span style="color: #BA36A5;">valid</span>){
<span id="coderef-autoboxing" class="coderef-off"><span class="linenr">21: </span>        data.add( valid ? 1 : <span style="color: #008000;">"1"</span>);</span>
<span class="linenr">22: </span>    }
<span class="linenr">23: </span>    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">int</span> <span style="color: #006699;">useData</span>(){
<span id="coderef-no-autounboxing" class="coderef-off"><span class="linenr">24: </span>        <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">res</span> = ((<span style="color: #6434A3;">Integer</span>)data.get(data.size()-1))*2;</span>
<span class="linenr">25: </span>        data.remove(data.size()-1);
<span class="linenr">26: </span>        <span style="color: #0000FF;">return</span> res;
<span class="linenr">27: </span>    }
<span class="linenr">28: </span>}
</pre>
</div>

<p>
java.lang.ClassCastException: java.lang.String cannot be cast to java.lang.Integer
	at HeterogenousContainerError.useData(HeterogenousContainerError.java:24)
	at HeterogenousContainerError.main(HeterogenousContainerError.java:14)
java.lang.ClassCastException: java.lang.String cannot be cast to java.lang.Integer
	at HeterogenousContainerError.useData(HeterogenousContainerError.java:24)
	at HeterogenousContainerError.main(HeterogenousContainerError.java:14)
</p>
</div>
</div>


<div id="outline-container-org9e96555" class="outline-3">
<h3 id="org9e96555"><span class="section-number-3">2.2</span> Les classes 'wrappers'</h3>
<div class="outline-text-3" id="text-2-2">
<p>
On vient de voir que les classes implémentant les structures de
données permettent de stocker n'importe quel <i>objet</i>. Mais on peut
vouloir stocker des valeurs de types primitifs. Pour chaque type
primitif, Java met à disposition une <a href="https://en.wikipedia.org/wiki/Primitive_wrapper_class">classe wrapper</a> qui permet, <a href="https://docs.oracle.com/javase/tutorial/java/data/numberclasses.html">entre
autres</a>, de stocker la valeur de type primitif à l'intérieur d'un
objet. Par exemple, on a vu la classe <a href="https://docs.oracle.com/javase/8/docs/api/java/lang/Integer.html">Integer</a> (plus précisément
<code class="src src-java"><span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">lang</span>.Integer</code>) qui correspond au type
primitf <code class="src src-java"><span style="color: #6434A3;">int</span></code>.
</p>

<dl class="org-dl">
<dt>Exercice</dt><dd>Trouver les classes correspondant aux autres types
primitifs.</dd>
</dl>



<p>
Ces classes permettent les conversions automatique depuis/vers les
types primitifs (<a href="https://docs.oracle.com/javase/tutorial/java/data/autoboxing.html">autoboxing / unboxing</a>), comme par exemple à la ligne
 <a href="#coderef-autoboxing" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-autoboxing');" onmouseout="CodeHighlightOff(this, 'coderef-autoboxing');">21</a>  du <a href="#src-HeterogenousContainerError">HeterogenousContainerError.java</a>.
</p>

<dl class="org-dl">
<dt>Exercice</dt><dd>Comprendre pourquoi il n'y a pas d'auto-unboxing à la
ligne  <a href="#coderef-no-autounboxing" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-no-autounboxing');" onmouseout="CodeHighlightOff(this, 'coderef-no-autounboxing');">24</a> .</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org611519e" class="outline-2">
<h2 id="org611519e"><span class="section-number-2">3</span> Stocker un nombre indéterminé d'éléments</h2>
<div class="outline-text-2" id="text-3">
<p>
Lorsqu'on veut stocker un nombre a priori indéterminé de valeurs, suivant qu'on s'intéresse à pouvoir efficacement :
</p>
<ul class="org-ul">
<li>ajouter des valeurs</li>
<li>ajouter et retirer des valeurs :
<ul class="org-ul">
<li>En retirant d'abord la dernière valeur ajoutée</li>
<li>En retirant d'abord la première valeur ajoutée</li>
</ul></li>
</ul>


<p>
Ces trois cas d'utilisation correspondent à différentes classes de la
bibliothèque standard.
</p>
</div>
