session1/cours/java_collections.md


<a id="org83dd9ef"></a>

## Pourquoi des classes génériques ?

En fait, on pourrait stocker des objets de n'importe quel type (n'importe quelle classe) car tous les objets peuvent être considérés comme des instances de la classe [Object](https://docs.oracle.com/javase/8/docs/api/java/lang/Object.html) <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>.

De telles structures de données permettraient d'avoir des collections *hétérogènes*, mais surtout ne permettraient pas d'assurer que des collections sont *homogènes*, ce qui est le cas le plus fréquent, perdant l'intérêt du typage statique. C'est en essayant d'utiliser une valeur récupérée dans une collection qu'on aurait une erreur à l'exécution, alors qu'on aurait voulu avoir une erreur de compilation à l'insertion puisque c'est là qu'était l'erreur.

```java
 1  import java.util.ArrayList;
 2  
 3  public class HeterogenousContainerError{
 4      static ArrayList data = new ArrayList();
 5  
 6      public static void main(String[] args){
 7  	try {
 8  	    createData(true);
 9  	    createData(true);
10  	    createData(false);
11  	    createData(true);
12  	    
13  	    useData();
14  	    useData();
15  	    useData();
16  	}catch(Exception e){
17  	    e.printStackTrace(System.out);
18  	}
19      }
20      public static void createData(boolean valid){
21  	data.add( valid ? 1 : "1");
22      }
23      public static int useData(){
24  	int res = ((Integer)data.get(data.size()-1))*2;
25  	data.remove(data.size()-1);
26  	return res;
27      }
28  }
```

java.lang.ClassCastException: java.lang.String cannot be cast to java.lang.Integer at HeterogenousContainerError.useData(HeterogenousContainerError.java:24) at HeterogenousContainerError.main(HeterogenousContainerError.java:14) java.lang.ClassCastException: java.lang.String cannot be cast to java.lang.Integer at HeterogenousContainerError.useData(HeterogenousContainerError.java:24) at HeterogenousContainerError.main(HeterogenousContainerError.java:14)


<a id="org29a6baa"></a>

## Les classes 'wrappers'

On vient de voir que les classes implémentant les structures de données permettent de stocker n'importe quel *objet*. Mais on peut vouloir stocker des valeurs de types primitifs. Pour chaque type primitif, Java met à disposition une [classe wrapper](https://en.wikipedia.org/wiki/Primitive_wrapper_class) qui permet, [entre autres](https://docs.oracle.com/javase/tutorial/java/data/numberclasses.html), de stocker la valeur de type primitif à l'intérieur d'un objet. Par exemple, on a vu la classe [Integer](https://docs.oracle.com/javase/8/docs/api/java/lang/Integer.html) (plus précisément `java.lang.Integer`) qui correspond au type primitf `int`.

-   **Exercice:** Trouver les classes correspondant aux autres types primitifs.

Ces classes permettent les conversions automatique depuis/vers les types primitifs ([autoboxing / unboxing](https://docs.oracle.com/javase/tutorial/java/data/autoboxing.html)), comme par exemple à la ligne 21 du [src-HeterogenousContainerError](#src-HeterogenousContainerError).

-   **Exercice:** Comprendre pourquoi il n'y a pas d'auto-unboxing à la ligne 24 .


<a id="orgbe4088b"></a>

# Stocker un nombre indéterminé d'éléments

Lorsqu'on veut stocker un nombre a priori indéterminé de valeurs, suivant qu'on s'intéresse à pouvoir efficacement :

-   ajouter des valeurs
-   ajouter et retirer des valeurs :
    -   En retirant d'abord la dernière valeur ajoutée
    -   En retirant d'abord la première valeur ajoutée

Ces trois cas d'utilisation correspondent à différentes classes de la bibliothèque standard.
