session1/cours/java_collections.org
** Listes

- [[https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html][java.util.ArrayList<E>]] (où E est la classe des éléments à stocker) :: c'est
     la classe qui correspond aux listes de python. Elle permet
     d'ajouter efficacement des éléments en fin de liste avec [[https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html#add-E-][add]] ou
     de supprimer efficacement le dernier élément en passant [[https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html#size--][.size()-1]]
     en argument à [[https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html#remove-int-][remove(int index)]]. Elle permet aussi des accès
     /aléatoire/ (/random access/) permettant d'accéder à n'importe
     quel élément en indiquant l'indice ([[https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html#get-int-][get(int index)]]).
- [[https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html][java.util.LinkedList<E>]] (où E est la classe des éléments à stocker) :: c'est
     une [[https://fr.wikipedia.org/wiki/Liste_cha%25C3%25AEn%25C3%25A9e#Liste_doublement_cha%25C3%25AEn%25C3%25A9e][liste doublement chaînée]] qui permet donc des ajout, accès et
     suppressions efficaces en début ou en fin de liste avec,
     respectivement, [[https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html#addFirst-E-][addFirst]], [[https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html#getFirst--][getFirst]] et [[https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html#removeFirst--][removeFirst]] ou [[https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html#addLast-E-][addLast]],
     [[https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html#getLast--][getLast]] et [[https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html#removeLast--][removeLast]]. En revanche, elle ne permet pas d'accès
     efficace à n'importe quel élément : pour la traverser
     efficacement, il faut accéder aux éléments dans l'ordre.

- Exercice :: Utiliser une ArrayList pour lire les lignes d'un
              [[file:~/Documents/Workspaces/Teaching/corp-bnp-renault/session1/ressource/books/Spinoza/Spinoza-Ethique.txt][fichier texte]].

** Piles (/Stack/)

Les structures de données de type /LIFO/ (Last In First Out), ou
/piles/(/Stack/[fn::Il y a une classe java.util.Stack, mais on ne
l'utilise plus car elle n'est pas performante.]) (car comme sur une
pile d'objet, on enlève le dernier élément ajouté), peuvent être
réalisées efficacement avec une [[https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html][java.util.ArrayList]] en ajoutant et
retirant en fin de liste. Elles peuvent aussi être implémentées avec
une [[https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html][java.util.LinkedList]], soit en ajoutant et retirant en début de
liste, soit en ajoutant et retirant en fin de liste.

** Files (/Queues/)

Les structures de données de type /FIFO/ (First In First Out), ou
/files/ (/Queue/), peuvent être implémentées par une
[[https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html][java.util.LinkedList]] en ajoutant en début de liste et retirant en fin
de liste (ou l'inverse).

* Stocker et rechercher des valeurs sans doublons

Si l'on veut stocker des valeurs sans doublons [fn:: c'est-à-đire que
si l'on essaie de mettre plusieurs fois des valeurs égales dans un tel
ensemble (/set/), elle ne sera présente qu'une seule fois.] et pouvoir
tester efficacement si un certain /ensemble/ contient déjà une valeur
donnée, on peut utiliser l'un des classes suivantes :

- [[https://docs.oracle.com/javase/8/docs/api/java/util/HashSet.html][HashSet<E>]] :: c'est une structure de données qui stocke les éléments
                "dans le désordre" de façon à les indexer et pouvoir y
                accéder rapidement en fonction de leur valeur. Ainsi,
                la méthode [[https://docs.oracle.com/javase/8/docs/api/java/util/HashSet.html#contains-java.lang.Object-][contains]] est très efficace.
- [[https://docs.oracle.com/javase/8/docs/api/java/util/TreeSet.html][TreeSet<E>]] :: c'est une structure de données qui stocke les éléments
     selon un ordre, afin de pouvoir faire des recherche
     dichotomiques. Elle est en générale un peu moins performante que
      [[https://docs.oracle.com/javase/8/docs/api/java/util/HashSet.html][HashSet<E>]] mais permet d'accéder aux éléments dans l'ordre.



- Exercice :: Permettre de recherche efficacement si des noms de domaine
              sont dans [[file:~/Documents/Workspaces/Teaching/corp-bnp-renault/session1/ressource/hosts/bad-hosts.txt][une liste de noms de domaines /blacklistés/]].

