session1/cours/java_collections.html
<div id="outline-container-org65423a6" class="outline-3">
<h3 id="org65423a6"><span class="section-number-3">3.1</span> Listes</h3>
<div class="outline-text-3" id="text-3-1">
<dl class="org-dl">
<dt><a href="https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html">java.util.ArrayList&lt;E&gt;</a> (où E est la classe des éléments à stocker)</dt><dd>c'est
la classe qui correspond aux listes de python. Elle permet
d'ajouter efficacement des éléments en fin de liste avec <a href="https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html#add-E-">add</a> ou
de supprimer efficacement le dernier élément en passant <a href="https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html#size--">.size()-1</a>
en argument à <a href="https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html#remove-int-">remove(int index)</a>. Elle permet aussi des accès
<i>aléatoire</i> (<i>random access</i>) permettant d'accéder à n'importe
quel élément en indiquant l'indice (<a href="https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html#get-int-">get(int index)</a>).</dd>
<dt><a href="https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html">java.util.LinkedList&lt;E&gt;</a> (où E est la classe des éléments à stocker)</dt><dd>c'est
une <a href="https://fr.wikipedia.org/wiki/Liste_cha%C3%AEn%C3%A9e#Liste_doublement_cha%C3%AEn%C3%A9e">liste doublement chaînée</a> qui permet donc des ajout, accès et
suppressions efficaces en début ou en fin de liste avec,
respectivement, <a href="https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html#addFirst-E-">addFirst</a>, <a href="https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html#getFirst--">getFirst</a> et <a href="https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html#removeFirst--">removeFirst</a> ou <a href="https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html#addLast-E-">addLast</a>,
<a href="https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html#getLast--">getLast</a> et <a href="https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html#removeLast--">removeLast</a>. En revanche, elle ne permet pas d'accès
efficace à n'importe quel élément : pour la traverser
efficacement, il faut accéder aux éléments dans l'ordre.</dd>

<dt>Exercice</dt><dd>Utiliser une ArrayList pour lire les lignes d'un
<a href="file:///home/bernard/Documents/Workspaces/Teaching/corp-bnp-renault/session1/ressource/books/Spinoza/Spinoza-Ethique.txt">fichier texte</a>.</dd>
</dl>
</div>
</div>

<div id="outline-container-org978b657" class="outline-3">
<h3 id="org978b657"><span class="section-number-3">3.2</span> Piles (<i>Stack</i>)</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Les structures de données de type <i>LIFO</i> (Last In First Out), ou
<i>piles/(/Stack</i><sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>) (car comme sur une
pile d'objet, on enlève le dernier élément ajouté), peuvent être
réalisées efficacement avec une <a href="https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html">java.util.ArrayList</a> en ajoutant et
retirant en fin de liste. Elles peuvent aussi être implémentées avec
une <a href="https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html">java.util.LinkedList</a>, soit en ajoutant et retirant en début de
liste, soit en ajoutant et retirant en fin de liste.
</p>
</div>
</div>

<div id="outline-container-org9dd0b02" class="outline-3">
<h3 id="org9dd0b02"><span class="section-number-3">3.3</span> Files (<i>Queues</i>)</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Les structures de données de type <i>FIFO</i> (First In First Out), ou
<i>files</i> (<i>Queue</i>), peuvent être implémentées par une
<a href="https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html">java.util.LinkedList</a> en ajoutant en début de liste et retirant en fin
de liste (ou l'inverse).
</p>
</div>
</div>
</div>

<div id="outline-container-orgba0014c" class="outline-2">
<h2 id="orgba0014c"><span class="section-number-2">4</span> Stocker et rechercher des valeurs sans doublons</h2>
<div class="outline-text-2" id="text-4">
<p>
Si l'on veut stocker des valeurs sans doublons <sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup> et pouvoir
tester efficacement si un certain <i>ensemble</i> contient déjà une valeur
donnée, on peut utiliser l'un des classes suivantes :
</p>

<dl class="org-dl">
<dt><a href="https://docs.oracle.com/javase/8/docs/api/java/util/HashSet.html">HashSet&lt;E&gt;</a></dt><dd>c'est une structure de données qui stocke les éléments
"dans le désordre" de façon à les indexer et pouvoir y
accéder rapidement en fonction de leur valeur. Ainsi,
la méthode <a href="https://docs.oracle.com/javase/8/docs/api/java/util/HashSet.html#contains-java.lang.Object-">contains</a> est très efficace.</dd>
<dt><a href="https://docs.oracle.com/javase/8/docs/api/java/util/TreeSet.html">TreeSet&lt;E&gt;</a></dt><dd>c'est une structure de données qui stocke les éléments
selon un ordre, afin de pouvoir faire des recherche
dichotomiques. Elle est en générale un peu moins performante que
 <a href="https://docs.oracle.com/javase/8/docs/api/java/util/HashSet.html">HashSet&lt;E&gt;</a> mais permet d'accéder aux éléments dans l'ordre.</dd>
</dl>



<dl class="org-dl">
<dt>Exercice</dt><dd>Permettre de recherche efficacement si des noms de domaine
sont dans <a href="file:///home/bernard/Documents/Workspaces/Teaching/corp-bnp-renault/session1/ressource/hosts/bad-hosts.txt">une liste de noms de domaines <i>blacklistés</i></a>.</dd>
</dl>
</div>
</div>
