session1/cours/java_collections.md


<a id="orgbb904ef"></a>

## Listes

-   **[java.util.ArrayList<E>](https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html) (où E est la classe des éléments à stocker):** c'est la classe qui correspond aux listes de python. Elle permet d'ajouter efficacement des éléments en fin de liste avec [add](https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html#add-E-) ou de supprimer efficacement le dernier élément en passant [.size()-1](https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html#size--) en argument à [remove(int index)](https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html#remove-int-). Elle permet aussi des accès *aléatoire* (*random access*) permettant d'accéder à n'importe quel élément en indiquant l'indice ([get(int index)](https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html#get-int-)).
-   **[java.util.LinkedList<E>](https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html) (où E est la classe des éléments à stocker):** c'est une [liste doublement chaînée](https://fr.wikipedia.org/wiki/Liste_cha%C3%AEn%C3%A9e#Liste_doublement_cha%C3%AEn%C3%A9e) qui permet donc des ajout, accès et suppressions efficaces en début ou en fin de liste avec, respectivement, [addFirst](https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html#addFirst-E-), [getFirst](https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html#getFirst--) et [removeFirst](https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html#removeFirst--) ou [addLast](https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html#addLast-E-), [getLast](https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html#getLast--) et [removeLast](https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html#removeLast--). En revanche, elle ne permet pas d'accès efficace à n'importe quel élément : pour la traverser efficacement, il faut accéder aux éléments dans l'ordre.

-   **Exercice:** Utiliser une ArrayList pour lire les lignes d'un [fichier texte](file:///home/bernard/Documents/Workspaces/Teaching/corp-bnp-renault/session1/ressource/books/Spinoza/Spinoza-Ethique.txt).


<a id="orgf4d160f"></a>

## Piles (*Stack*)

Les structures de données de type *LIFO* (Last In First Out), ou *piles/(/Stack*<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>) (car comme sur une pile d'objet, on enlève le dernier élément ajouté), peuvent être réalisées efficacement avec une [java.util.ArrayList](https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html) en ajoutant et retirant en fin de liste. Elles peuvent aussi être implémentées avec une [java.util.LinkedList](https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html), soit en ajoutant et retirant en début de liste, soit en ajoutant et retirant en fin de liste.


<a id="org0d16045"></a>

## Files (*Queues*)

Les structures de données de type *FIFO* (First In First Out), ou *files* (*Queue*), peuvent être implémentées par une [java.util.LinkedList](https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html) en ajoutant en début de liste et retirant en fin de liste (ou l'inverse).


<a id="org562f855"></a>

# Stocker et rechercher des valeurs sans doublons

Si l'on veut stocker des valeurs sans doublons <sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup> et pouvoir tester efficacement si un certain *ensemble* contient déjà une valeur donnée, on peut utiliser l'un des classes suivantes :

-   **[HashSet<E>](https://docs.oracle.com/javase/8/docs/api/java/util/HashSet.html):** c'est une structure de données qui stocke les éléments "dans le désordre" de façon à les indexer et pouvoir y accéder rapidement en fonction de leur valeur. Ainsi, la méthode [contains](https://docs.oracle.com/javase/8/docs/api/java/util/HashSet.html#contains-java.lang.Object-) est très efficace.
-   **[TreeSet<E>](https://docs.oracle.com/javase/8/docs/api/java/util/TreeSet.html):** c'est une structure de données qui stocke les éléments selon un ordre, afin de pouvoir faire des recherche dichotomiques. Elle est en générale un peu moins performante que [HashSet<E>](https://docs.oracle.com/javase/8/docs/api/java/util/HashSet.html) mais permet d'accéder aux éléments dans l'ordre.

-   **Exercice:** Permettre de recherche efficacement si des noms de domaine sont dans [une liste de noms de domaines *blacklistés*](file:///home/bernard/Documents/Workspaces/Teaching/corp-bnp-renault/session1/ressource/hosts/bad-hosts.txt).
