session1/cours/java_collections.org
* Associer des valeurs à des clés

Les tableaux permettent d'associer une valeur (le contenu d'une case
du tableau) à un indice compris entre 0 et ~(nombre de cases du
tableau - 1)~. On peut vouloir généraliser ce genre d'association à
tous types de /clés/, par exemple pour pouvoir associer des adresses
IP à des noms de domaines. C'est ce que permettent les /dictionnaires/
en python où les tables d'association (/maps/) en Java. Elles sont
paramétrées par deux types, le paramétrage src_java[:exports
code]{<K,V>} indiquant, respectivement, la classe de la clé et la
classe de la valeur associée. On associe une valeur src_java[:exports
code]{v} de classe src_java[:exports code]{V} à la clé
src_java[:exports code]{k} de type src_java[:exports code]{K} avec la
méthode [[https://docs.oracle.com/javase/8/docs/api/java/util/Map.html#put-K-V-][put(K k, V v)]]. On récupère la valeur associée à la clé
src_java[:exports code]{k} avec la méthode [[https://docs.oracle.com/javase/8/docs/api/java/util/Map.html#get-java.lang.Object-][get(K k)]]. Pour permettre de
trouver efficacement la valeur associée à une clé, les clés des tables
d'association sont organisées de façon similaire aux éléments d'un
ensemble. On aura donc les deux classes suivantes, suivant que les
clés soient indexées ou ordonnées :

- [[https://docs.oracle.com/javase/8/docs/api/java/util/HashMap.html][HashMap<K,V>]] :: c'est une table d'association dans laquelle les clés
     sont indexées pour permettre un accès très efficace.
- [[https://docs.oracle.com/javase/8/docs/api/java/util/TreeMap.html][TreeMap<K,V>]] :: c'est une table d'association dans laquelle les clés
     sont ordonnées pour permettre un accès par recherche
     dichotomique.

- Exercice :: Compter le nombre d'occurrences de chaque mot dans [[file:~/Documents/Workspaces/Teaching/corp-bnp-renault/session1/ressource/books/mots.txt][un
              fichier de mots]].

* Implémenter des classes qui peuvent être utilisées dans des Collections

On peut utiliser les structures de données pour stocker des instances
de [[https://docs.oracle.com/javase/9/docs/api/java/lang/String.html][String]] et de toutes les classes /wrapper/ de tous les types
primitifs ([[https://docs.oracle.com/javase/9/docs/api/java/lang/Integer.html][Integer]], [[https://docs.oracle.com/javase/9/docs/api/java/lang/Long.html][Long]], [[https://docs.oracle.com/javase/9/docs/api/java/lang/Float.html][Float]], [[https://docs.oracle.com/javase/9/docs/api/java/lang/Double.html][Double]], …).  Lorsqu'on voudra pouvoir
stocker des instances de classes que nous définirons nous-mêmes
(cf. /Programmation Orientée Objet), il faudra prendre de soin de
définir correctement quelques méthodes pour que les instances de nos
classes soient utilisables dans ces structures de données.

** equals

Même si elle n'est pas aussi performante que pour les ensembles
(/sets/), les listes proposent aussi une méthode [[https://docs.oracle.com/javase/8/docs/api/java/util/List.html#contains-java.lang.Object-][contains]] qui permet
de savoir si un élément est contenu dans la liste. Les tables
d'association (/maps/) permettent efficacement, elles, de savoir si
une clé est présente dans la table. Dans tous ces cas, il s'agit de
trouver un élément (ou une clé) *égal* à l'argument et non pas
seulement *identique*. Il faut donc que l'égalité soit définie, ce qui
se fait en Java en redéfinissant la [[https://docs.oracle.com/javase/tutorial/java/IandI/objectclass.html][méthode equals]].

Généralement, des instances seront égales lorsque tous leurs attributs
sont égaux (au sens de leur [[https://docs.oracle.com/javase/tutorial/java/IandI/objectclass.html][méthode equals]] lorsqu'il s'agit d'objets).

En pratique, on va redéfinir la méthode src_java[:exports
code]{equals} en combinants les résultats des tests d'égalité (et non
pas d'ientité !) des différents attributs avec l'opérateur
src_java[:exports code]{&&} (ET logique):
#+BEGIN_SRC java :exports code
  public class Person {
      private String firstname;
      private String lastname;
      private int age;

      @Override
      public boolean equals(Object o){
	  if(! o instanceof Person){
	      return false;
	  }
	  Person other= (Person) o;
	  return firstname.equals(o.firstname) && lastname.equals(o.lastname) && (age == o.age);
      }
  }
#+END_SRC


- Note :: Lorsqu'on [[https://jmdoudoux.developpez.com/cours/developpons/java/chap-techniques_java.php#techniques_java-2][redéfinit equals, il faut aussi redéfinir
          hashcode]] (cf. infra).

