session1/cours/java_collections.html


<div id="outline-container-org84d9698" class="outline-2">
<h2 id="org84d9698"><span class="section-number-2">5</span> Associer des valeurs à des clés</h2>
<div class="outline-text-2" id="text-5">
<p>
Les tableaux permettent d'associer une valeur (le contenu d'une case
du tableau) à un indice compris entre 0 et <code>(nombre de cases du
tableau - 1)</code>. On peut vouloir généraliser ce genre d'association à
tous types de <i>clés</i>, par exemple pour pouvoir associer des adresses
IP à des noms de domaines. C'est ce que permettent les <i>dictionnaires</i>
en python où les tables d'association (<i>maps</i>) en Java. Elles sont
paramétrées par deux types, le paramétrage <code class="src src-java">&lt;<span style="color: #6434A3;">K</span>,<span style="color: #6434A3;">V</span>&gt;</code> indiquant, respectivement, la classe de la clé et la
classe de la valeur associée. On associe une valeur <code class="src src-java">v</code> de classe <code class="src src-java">V</code> à la clé
<code class="src src-java">k</code> de type <code class="src src-java">K</code> avec la
méthode <a href="https://docs.oracle.com/javase/8/docs/api/java/util/Map.html#put-K-V-">put(K k, V v)</a>. On récupère la valeur associée à la clé
<code class="src src-java">k</code> avec la méthode <a href="https://docs.oracle.com/javase/8/docs/api/java/util/Map.html#get-java.lang.Object-">get(K k)</a>. Pour permettre de
trouver efficacement la valeur associée à une clé, les clés des tables
d'association sont organisées de façon similaire aux éléments d'un
ensemble. On aura donc les deux classes suivantes, suivant que les
clés soient indexées ou ordonnées :
</p>

<dl class="org-dl">
<dt><a href="https://docs.oracle.com/javase/8/docs/api/java/util/HashMap.html">HashMap&lt;K,V&gt;</a></dt><dd>c'est une table d'association dans laquelle les clés
sont indexées pour permettre un accès très efficace.</dd>
<dt><a href="https://docs.oracle.com/javase/8/docs/api/java/util/TreeMap.html">TreeMap&lt;K,V&gt;</a></dt><dd>c'est une table d'association dans laquelle les clés
sont ordonnées pour permettre un accès par recherche
dichotomique.</dd>

<dt>Exercice</dt><dd>Compter le nombre d'occurrences de chaque mot dans <a href="file:///home/bernard/Documents/Workspaces/Teaching/corp-bnp-renault/session1/ressource/books/mots.txt">un
fichier de mots</a>.</dd>
</dl>
</div>
</div>

<div id="outline-container-orge8e840d" class="outline-2">
<h2 id="orge8e840d"><span class="section-number-2">6</span> Implémenter des classes qui peuvent être utilisées dans des Collections</h2>
<div class="outline-text-2" id="text-6">
<p>
On peut utiliser les structures de données pour stocker des instances
de <a href="https://docs.oracle.com/javase/9/docs/api/java/lang/String.html">String</a> et de toutes les classes <i>wrapper</i> de tous les types
primitifs (<a href="https://docs.oracle.com/javase/9/docs/api/java/lang/Integer.html">Integer</a>, <a href="https://docs.oracle.com/javase/9/docs/api/java/lang/Long.html">Long</a>, <a href="https://docs.oracle.com/javase/9/docs/api/java/lang/Float.html">Float</a>, <a href="https://docs.oracle.com/javase/9/docs/api/java/lang/Double.html">Double</a>, …).  Lorsqu'on voudra pouvoir
stocker des instances de classes que nous définirons nous-mêmes
(cf. /Programmation Orientée Objet), il faudra prendre de soin de
définir correctement quelques méthodes pour que les instances de nos
classes soient utilisables dans ces structures de données.
</p>
</div>

<div id="outline-container-org9f82f11" class="outline-3">
<h3 id="org9f82f11"><span class="section-number-3">6.1</span> equals</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Même si elle n'est pas aussi performante que pour les ensembles
(<i>sets</i>), les listes proposent aussi une méthode <a href="https://docs.oracle.com/javase/8/docs/api/java/util/List.html#contains-java.lang.Object-">contains</a> qui permet
de savoir si un élément est contenu dans la liste. Les tables
d'association (<i>maps</i>) permettent efficacement, elles, de savoir si
une clé est présente dans la table. Dans tous ces cas, il s'agit de
trouver un élément (ou une clé) <b>égal</b> à l'argument et non pas
seulement <b>identique</b>. Il faut donc que l'égalité soit définie, ce qui
se fait en Java en redéfinissant la <a href="https://docs.oracle.com/javase/tutorial/java/IandI/objectclass.html">méthode equals</a>.
</p>

<p>
Généralement, des instances seront égales lorsque tous leurs attributs
sont égaux (au sens de leur <a href="https://docs.oracle.com/javase/tutorial/java/IandI/objectclass.html">méthode equals</a> lorsqu'il s'agit d'objets).
</p>


<dl class="org-dl">
<dt>Note</dt><dd>Lorsqu'on <a href="https://jmdoudoux.developpez.com/cours/developpons/java/chap-techniques_java.php#techniques_java-2">redéfinit equals, il faut aussi redéfinir
hashcode</a> (cf. infra).</dd>
</dl>
</div>
</div>
