session1/cours/java_collections.md


<a id="orgcf43958"></a>

# Associer des valeurs à des clés

Les tableaux permettent d'associer une valeur (le contenu d'une case du tableau) à un indice compris entre 0 et `(nombre de cases du tableau - 1)`. On peut vouloir généraliser ce genre d'association à tous types de *clés*, par exemple pour pouvoir associer des adresses IP à des noms de domaines. C'est ce que permettent les *dictionnaires* en python où les tables d'association (*maps*) en Java. Elles sont paramétrées par deux types, le paramétrage `<K,V>` indiquant, respectivement, la classe de la clé et la classe de la valeur associée. On associe une valeur `v` de classe `V` à la clé `k` de type `K` avec la méthode [put(K k, V v)](https://docs.oracle.com/javase/8/docs/api/java/util/Map.html#put-K-V-). On récupère la valeur associée à la clé `k` avec la méthode [get(K k)](https://docs.oracle.com/javase/8/docs/api/java/util/Map.html#get-java.lang.Object-). Pour permettre de trouver efficacement la valeur associée à une clé, les clés des tables d'association sont organisées de façon similaire aux éléments d'un ensemble. On aura donc les deux classes suivantes, suivant que les clés soient indexées ou ordonnées :

-   **[HashMap<K,V>](https://docs.oracle.com/javase/8/docs/api/java/util/HashMap.html):** c'est une table d'association dans laquelle les clés sont indexées pour permettre un accès très efficace.
-   **[TreeMap<K,V>](https://docs.oracle.com/javase/8/docs/api/java/util/TreeMap.html):** c'est une table d'association dans laquelle les clés sont ordonnées pour permettre un accès par recherche dichotomique.

-   **Exercice:** Compter le nombre d'occurrences de chaque mot dans [un fichier de mots](file:///home/bernard/Documents/Workspaces/Teaching/corp-bnp-renault/session1/ressource/books/mots.txt).


<a id="org0eca174"></a>

# Implémenter des classes qui peuvent être utilisées dans des Collections

On peut utiliser les structures de données pour stocker des instances de [String](https://docs.oracle.com/javase/9/docs/api/java/lang/String.html) et de toutes les classes *wrapper* de tous les types primitifs ([Integer](https://docs.oracle.com/javase/9/docs/api/java/lang/Integer.html), [Long](https://docs.oracle.com/javase/9/docs/api/java/lang/Long.html), [Float](https://docs.oracle.com/javase/9/docs/api/java/lang/Float.html), [Double](https://docs.oracle.com/javase/9/docs/api/java/lang/Double.html), …). Lorsqu'on voudra pouvoir stocker des instances de classes que nous définirons nous-mêmes (cf. /Programmation Orientée Objet), il faudra prendre de soin de définir correctement quelques méthodes pour que les instances de nos classes soient utilisables dans ces structures de données.


<a id="org2330e27"></a>

## equals

Même si elle n'est pas aussi performante que pour les ensembles (*sets*), les listes proposent aussi une méthode [contains](https://docs.oracle.com/javase/8/docs/api/java/util/List.html#contains-java.lang.Object-) qui permet de savoir si un élément est contenu dans la liste. Les tables d'association (*maps*) permettent efficacement, elles, de savoir si une clé est présente dans la table. Dans tous ces cas, il s'agit de trouver un élément (ou une clé) **égal** à l'argument et non pas seulement **identique**. Il faut donc que l'égalité soit définie, ce qui se fait en Java en redéfinissant la [méthode equals](https://docs.oracle.com/javase/tutorial/java/IandI/objectclass.html).

Généralement, des instances seront égales lorsque tous leurs attributs sont égaux (au sens de leur [méthode equals](https://docs.oracle.com/javase/tutorial/java/IandI/objectclass.html) lorsqu'il s'agit d'objets).

-   **Note:** Lorsqu'on [redéfinit equals, il faut aussi redéfinir hashcode](https://jmdoudoux.developpez.com/cours/developpons/java/chap-techniques_java.php#techniques_java-2) (cf. infra).
