session1/cours/java_collections.org
** hashCode

Les structures de données basées sur des index ([[https://docs.oracle.com/javase/8/docs/api/java/util/HashSet.html][HashSet<E>]],
[[https://docs.oracle.com/javase/8/docs/api/java/util/HashMap.html][HashMap<K,V>]]) utilisent un code numérique associé aux valeurs de
éléments / clés stockées. Cette valeur numérique (retournée par la
méthode [[https://fr.wikipedia.org/wiki/Java_hashCode()][hashcode en java]]) doit avoir les deux propriétés suivantes :

- obligatoirement :: deux objets égaux (au sens de la [[https://docs.oracle.com/javase/tutorial/java/IandI/objectclass.html][méthode equals]])
     doivent avoir la même valeur de hashcode.
- autant que possible :: on essaie d'éviter les /collisions/,
     c'est-à-dire qu'on essaie d'éviter que des objets qui ne sont pas
     égaux (toujours au sens de la [[https://docs.oracle.com/javase/tutorial/java/IandI/objectclass.html][méthode equals]]) aient la même
     valeur de hashcode.

En pratique, on va redéfinir la méthode src_java[:exports
code]{hashCode} en combinants les résultats des src_java[:exports
code]{hashCode()} des différents attributs avec l'opérateur
src_java[:exports code]{^} (OU eXclusif) :
#+BEGIN_SRC java :exports code :tangle Person.java
    public class Person {
	private String firstname;
	private String lastname;
	private int age;
	private double height;

	@Override
	public int hashCode(){
	    return  firstname.hashCode() ^ lastname.hashCode() ^ age ^ Double.valueOf(height).hashCode();
	}
    }
#+END_SRC


** <<sec:Comparable>> Interface Comparable ou objet Comparator

Lorsque l'on utilise une structure de donnée ( [[https://docs.oracle.com/javase/8/docs/api/java/util/TreeSet.html][TreeSet<E>]],
[[https://docs.oracle.com/javase/8/docs/api/java/util/TreeMap.html][TreeMap<K,V>]]) qui ordonne ses éléments / clés, celle-ci doit pouvoir
effectuer des comparaisons selon un [[https://fr.wikipedia.org/wiki/Ordre_total][ordre total]]. On définit pour cela
des méthodes de comparaison qui retournent un entier négatif, nul ou positif suivant que la première instance soit inférieure, égale ou supérieure à la seconde.

Cela peut se faire de deux façons différentes en Java :
- en définissant une relation d'ordre générale toujours valable pour toutes les
  instances en implémentant l'interface [[https://docs.oracle.com/javase/8/docs/api/java/lang/Comparable.html][Comparable]].
- de façon spécifique à une utilisation dans une structure de donnée
  en définissant une classe implémentant l'interface [[https://docs.oracle.com/javase/8/docs/api/java/util/Comparator.html][Comparator]] et en
  passant une instance de cette classe à la construction de la
  structure de données.

- Remarque :: L'interface [[https://docs.oracle.com/javase/8/docs/api/java/util/Comparator.html][Comparator]] permet de définir un ordre
              spécifique pour des instances de n'importe quelle
              classe. Cet ordre peut aussi être utilisé pour trier des
              listes avec la méthode [[https://docs.oracle.com/javase/8/docs/api/java/util/List.html#sort-java.util.Comparator-][sort]].

* Interfaces

On a pu constater que plusieurs classes pouvaient offrir les mêmes
/fonctionnalités/, avec des implémentations différentes. La
/Programmation Orientée Objet/ de Java permet de définir des
[[https://docs.oracle.com/javase/tutorial/java/IandI/createinterface.html][interfaces]] qui expriment ces fonctionnalités. En pratique, on
manipulera les instances autant que possible selon une interface, afin
de laisser libre la classe d'implémentation.

Par exemple, si l'on définit une fonction prenant en argument une
liste, on aura intérêt à définir par exemple:
#+BEGIN_SRC java :exports code
public static void anyFunction(List<Integer> xs){
    /* implémentation */
}
#+END_SRC
Plutôt que :
#+BEGIN_SRC java :exports code
public static void anyFunction(ArrayList<Integer> xs){
    /* implémentation */
}
#+END_SRC
et ou
#+BEGIN_SRC java :exports code
public static void anyFunction(LinkedList<Integer> xs){
    /* implémentation */
}
#+END_SRC

Sous réserve que la fonction src_java[:exports code]{anyfunction}
n'utilise que des fonctionnalités communes à [[https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html][ArrayList]] et à [[https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html][LinkedList]]
et donc mises à déclarées dans l'interface [[https://docs.oracle.com/javase/8/docs/api/java/util/List.html][List]].


