session1/cours/java_collections.html

<div id="outline-container-orgfd92853" class="outline-3">
<h3 id="orgfd92853"><span class="section-number-3">6.2</span> hashCode</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Les structures de données basées sur des index (<a href="https://docs.oracle.com/javase/8/docs/api/java/util/HashSet.html">HashSet&lt;E&gt;</a>,
<a href="https://docs.oracle.com/javase/8/docs/api/java/util/HashMap.html">HashMap&lt;K,V&gt;</a>) utilisent un code numérique associé aux valeurs de
éléments / clés stockées. Cette valeur numérique (retournée par la
méthode <a href="https://fr.wikipedia.org/wiki/Java_hashCode()">hashcode en java</a>) doit avoir les deux propriétés suivantes :
</p>

<dl class="org-dl">
<dt>obligatoirement</dt><dd>deux objets égaux (au sens de la <a href="https://docs.oracle.com/javase/tutorial/java/IandI/objectclass.html">méthode equals</a>)
doivent avoir la même valeur de hashcode.</dd>
<dt>autant que possible</dt><dd>on essaie d'éviter les <i>collisions</i>,
c'est-à-dire qu'on essaie d'éviter que des objets qui ne sont pas
égaux (toujours au sens de la <a href="https://docs.oracle.com/javase/tutorial/java/IandI/objectclass.html">méthode equals</a>) aient la même
valeur de hashcode.</dd>
</dl>
</div>
</div>


<div id="outline-container-org8d184b3" class="outline-3">
<h3 id="org8d184b3"><span class="section-number-3">6.3</span> Interface Comparable ou objet Comparator</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Lorsque l'on utilise une structure de donnée ( <a href="https://docs.oracle.com/javase/8/docs/api/java/util/TreeSet.html">TreeSet&lt;E&gt;</a>,
<a href="https://docs.oracle.com/javase/8/docs/api/java/util/TreeMap.html">TreeMap&lt;K,V&gt;</a>) qui ordonne ses éléments / clés, celle-ci doit pouvoir
effectuer des comparaisons selon un <a href="https://fr.wikipedia.org/wiki/Ordre_total">ordre total</a>. On définit pour cela
des méthodes de comparaison qui retournent un entier négatif, nul ou positif suivant que la première instance soit inférieure, égale ou supérieure à la seconde.
</p>

<p>
Cela peut se faire de deux façons différentes en Java :
</p>
<ul class="org-ul">
<li>en définissant une relation d'ordre générale toujours valable pour toutes les
instances en implémentant l'interface <a href="https://docs.oracle.com/javase/8/docs/api/java/lang/Comparable.html">Comparable</a>.</li>
<li>de façon spécifique à une utilisation dans une structure de donnée
en définissant une classe implémentant l'interface <a href="https://docs.oracle.com/javase/8/docs/api/java/util/Comparator.html">Comparator</a> et en
passant une instance de cette classe à la construction de la
structure de données.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2f00c4f" class="outline-2">
<h2 id="org2f00c4f"><span class="section-number-2">7</span> Interfaces</h2>
<div class="outline-text-2" id="text-7">
<p>
On a pu constater que plusieurs classes pouvaient offrir les mêmes
<i>fonctionnalités</i>, avec des implémentations différentes. La
<i>Programmation Orientée Objet</i> de Java permet de définir des
<a href="https://docs.oracle.com/javase/tutorial/java/IandI/createinterface.html">interfaces</a> qui expriment ces fonctionnalités. En pratique, on
manipulera les instances autant que possible selon une interface, afin
de laisser libre la classe d'implémentation.
</p>

<p>
Par exemple, si l'on définit une fonction prenant en argument une
liste, on aura intérêt à définir par exemple:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">anyFunction</span>(<span style="color: #6434A3;">List</span>&lt;<span style="color: #6434A3;">Integer</span>&gt; <span style="color: #BA36A5;">xs</span>){
    <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">impl&#233;mentation */</span>
}
</pre>
</div>
<p>
Plutôt que :
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">anyFunction</span>(<span style="color: #6434A3;">ArrayList</span>&lt;<span style="color: #6434A3;">Integer</span>&gt; <span style="color: #BA36A5;">xs</span>){
    <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">impl&#233;mentation */</span>
}
</pre>
</div>
<p>
et ou
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">anyFunction</span>(<span style="color: #6434A3;">LinkedList</span>&lt;<span style="color: #6434A3;">Integer</span>&gt; <span style="color: #BA36A5;">xs</span>){
    <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">impl&#233;mentation */</span>
}
</pre>
</div>

<p>
Sous réserve que la fonction <code class="src src-java">anyfunction</code>
n'utilise que des fonctionnalités communes à <a href="https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html">ArrayList</a> et à <a href="https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html">LinkedList</a>
et donc mises à déclarées dans l'interface <a href="https://docs.oracle.com/javase/8/docs/api/java/util/List.html">List</a>.
</p>
</div>
