session1/cours/java_collections.md


<a id="orgcf366b7"></a>

## hashCode

Les structures de données basées sur des index ([HashSet<E>](https://docs.oracle.com/javase/8/docs/api/java/util/HashSet.html), [HashMap<K,V>](https://docs.oracle.com/javase/8/docs/api/java/util/HashMap.html)) utilisent un code numérique associé aux valeurs de éléments / clés stockées. Cette valeur numérique (retournée par la méthode [hashcode en java](https://fr.wikipedia.org/wiki/Java_hashCode())) doit avoir les deux propriétés suivantes :

-   **obligatoirement:** deux objets égaux (au sens de la [méthode equals](https://docs.oracle.com/javase/tutorial/java/IandI/objectclass.html)) doivent avoir la même valeur de hashcode.
-   **autant que possible:** on essaie d'éviter les *collisions*, c'est-à-dire qu'on essaie d'éviter que des objets qui ne sont pas égaux (toujours au sens de la [méthode equals](https://docs.oracle.com/javase/tutorial/java/IandI/objectclass.html)) aient la même valeur de hashcode.


<a id="org3268424"></a>

## Interface Comparable ou objet Comparator

Lorsque l'on utilise une structure de donnée ( [TreeSet<E>](https://docs.oracle.com/javase/8/docs/api/java/util/TreeSet.html), [TreeMap<K,V>](https://docs.oracle.com/javase/8/docs/api/java/util/TreeMap.html)) qui ordonne ses éléments / clés, celle-ci doit pouvoir effectuer des comparaisons selon un [ordre total](https://fr.wikipedia.org/wiki/Ordre_total). On définit pour cela des méthodes de comparaison qui retournent un entier négatif, nul ou positif suivant que la première instance soit inférieure, égale ou supérieure à la seconde.

Cela peut se faire de deux façons différentes en Java :

-   en définissant une relation d'ordre générale toujours valable pour toutes les instances en implémentant l'interface [Comparable](https://docs.oracle.com/javase/8/docs/api/java/lang/Comparable.html).
-   de façon spécifique à une utilisation dans une structure de donnée en définissant une classe implémentant l'interface [Comparator](https://docs.oracle.com/javase/8/docs/api/java/util/Comparator.html) et en passant une instance de cette classe à la construction de la structure de données.


<a id="org9806d7f"></a>

# Interfaces

On a pu constater que plusieurs classes pouvaient offrir les mêmes *fonctionnalités*, avec des implémentations différentes. La *Programmation Orientée Objet* de Java permet de définir des [interfaces](https://docs.oracle.com/javase/tutorial/java/IandI/createinterface.html) qui expriment ces fonctionnalités. En pratique, on manipulera les instances autant que possible selon une interface, afin de laisser libre la classe d'implémentation.

Par exemple, si l'on définit une fonction prenant en argument une liste, on aura intérêt à définir par exemple:

```java
public static void anyFunction(List<Integer> xs){
    /* implémentation */
}
```

Plutôt que :

```java
public static void anyFunction(ArrayList<Integer> xs){
    /* implémentation */
}
```

et ou

```java
public static void anyFunction(LinkedList<Integer> xs){
    /* implémentation */
}
```

Sous réserve que la fonction `anyfunction` n'utilise que des fonctionnalités communes à [ArrayList](https://docs.oracle.com/javase/8/docs/api/java/util/ArrayList.html) et à [LinkedList](https://docs.oracle.com/javase/8/docs/api/java/util/LinkedList.html) et donc mises à déclarées dans l'interface [List](https://docs.oracle.com/javase/8/docs/api/java/util/List.html).
