session1/cours/java_collections.org
** List

[[https://jmdoudoux.developpez.com/cours/developpons/java/chap-collections.php#collections-3][L'interface List est implémentée par de nombreuses classes]] et à chaque
fois que possible, on utilisera la classe concrète aussi peu que
possible (i.e. à l'instanciation), par exemple en écrivant :
#+BEGIN_SRC java :exports code
List<String> myStrings = new ArrayList<String>();
#+END_SRC
ou 
#+BEGIN_SRC java :exports code
List<String> myStrings = new LinkedList<String>();
#+END_SRC

plutôt que :
#+BEGIN_SRC java :exports code
ArrayList<String> myStrings = new ArrayList<String>();
#+END_SRC
ou 
#+BEGIN_SRC java :exports code
LinkedList<String> myStrings = new LinkedList<String>();
#+END_SRC


** Set

[[https://jmdoudoux.developpez.com/cours/developpons/java/chap-collections.php#collections-4][L'interface Set fait partie d'une hiérarchies de classes]] et on
l'utilisera à chaque fois que possible, par exemple en écrivant :

#+BEGIN_SRC java :exports code
Set<String> myStrings = new HashSet<String>();
#+END_SRC
ou
#+BEGIN_SRC java :exports code
Set<String> myStrings = new TreeSet<String>();
#+END_SRC

plutôt que :
#+BEGIN_SRC java :exports code
HashSet<String> myStrings = new HashSet<String>();
#+END_SRC
ou
#+BEGIN_SRC java :exports code
TreeSet<String> myStrings = new TreeSet<String>();
#+END_SRC


** Map

[[https://jmdoudoux.developpez.com/cours/developpons/java/chap-collections.php#collections-5][L'interface Map fait partie d'une hiérarchie de classes]] et on
l'utilisera à chaque fois que possible, par exemple en écrivant :

#+BEGIN_SRC java :exports code
Map<String, Integer> stringToInt = new HashMap<String, Integer>();
#+END_SRC
ou
#+BEGIN_SRC java :exports code
Map<String, Integer> stringToInt = new TreeMap<String, Integer>();
#+END_SRC

plutôt que :
#+BEGIN_SRC java :exports code
HashMap<String, Integer> stringToInt = new HashMap<String, Integer>();
#+END_SRC
ou
#+BEGIN_SRC java :exports code
TreeMap<String, Integer> stringToInt = new TreeMap<String, Integer>();
#+END_SRC

** Collection

En fait, il y a quelques fonctionnalités qui sont communes à toutes
les structures de données (notamment le fait de pouvoir la parcourir,
savoir si elle est vide ou connaître sa taille). L'interface
[[https://docs.oracle.com/javase/8/docs/api/java/util/Collection.html][Collection]] permet d'exprimer ce niveau d'abstraction. Lorsque cela est
possible, on aura donc intérêt à prendre les arguments en tant que
[[https://docs.oracle.com/javase/8/docs/api/java/util/Collection.html][Collection]] pour avoir le code le plus générique et réutilisable
possible.

On peut par exemple parcourir n'importe quelle collection soit [[https://www.baeldung.com/java-iterator][avec un
Iterator]], soit avec la boucle src_java[:exports code]{for( X x : xs)}
où src_java[:exports code]{xs} est un src_java[:exports code]{X[]} ou
une src_java[:exports code]{Collection<X>}.

