session1/cours/java_collections.html


<div id="outline-container-org9201984" class="outline-3">
<h3 id="org9201984"><span class="section-number-3">7.1</span> List</h3>
<div class="outline-text-3" id="text-7-1">
<p>
<a href="https://jmdoudoux.developpez.com/cours/developpons/java/chap-collections.php#collections-3">L'interface List est implémentée par de nombreuses classes</a> et à chaque
fois que possible, on utilisera la classe concrète aussi peu que
possible (i.e. à l'instanciation), par exemple en écrivant :
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #6434A3;">List</span>&lt;<span style="color: #6434A3;">String</span>&gt; <span style="color: #BA36A5;">myStrings</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">ArrayList</span>&lt;<span style="color: #6434A3;">String</span>&gt;();
</pre>
</div>
<p>
ou 
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #6434A3;">List</span>&lt;<span style="color: #6434A3;">String</span>&gt; <span style="color: #BA36A5;">myStrings</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">LinkedList</span>&lt;<span style="color: #6434A3;">String</span>&gt;();
</pre>
</div>

<p>
plutôt que :
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #6434A3;">ArrayList</span>&lt;<span style="color: #6434A3;">String</span>&gt; <span style="color: #BA36A5;">myStrings</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">ArrayList</span>&lt;<span style="color: #6434A3;">String</span>&gt;();
</pre>
</div>
<p>
ou 
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #6434A3;">LinkedList</span>&lt;<span style="color: #6434A3;">String</span>&gt; <span style="color: #BA36A5;">myStrings</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">LinkedList</span>&lt;<span style="color: #6434A3;">String</span>&gt;();
</pre>
</div>
</div>
</div>


<div id="outline-container-org8e8794a" class="outline-3">
<h3 id="org8e8794a"><span class="section-number-3">7.2</span> Set</h3>
<div class="outline-text-3" id="text-7-2">
<p>
<a href="https://jmdoudoux.developpez.com/cours/developpons/java/chap-collections.php#collections-4">L'interface Set fait partie d'une hiérarchies de classes</a> et on
l'utilisera à chaque fois que possible, par exemple en écrivant :
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #6434A3;">Set</span>&lt;<span style="color: #6434A3;">String</span>&gt; <span style="color: #BA36A5;">myStrings</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">HashSet</span>&lt;<span style="color: #6434A3;">String</span>&gt;();
</pre>
</div>
<p>
ou
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #6434A3;">Set</span>&lt;<span style="color: #6434A3;">String</span>&gt; <span style="color: #BA36A5;">myStrings</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">TreeSet</span>&lt;<span style="color: #6434A3;">String</span>&gt;();
</pre>
</div>

<p>
plutôt que :
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #6434A3;">HashSet</span>&lt;<span style="color: #6434A3;">String</span>&gt; <span style="color: #BA36A5;">myStrings</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">HashSet</span>&lt;<span style="color: #6434A3;">String</span>&gt;();
</pre>
</div>
<p>
ou
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #6434A3;">TreeSet</span>&lt;<span style="color: #6434A3;">String</span>&gt; <span style="color: #BA36A5;">myStrings</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">TreeSet</span>&lt;<span style="color: #6434A3;">String</span>&gt;();
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc10485f" class="outline-3">
<h3 id="orgc10485f"><span class="section-number-3">7.3</span> Map</h3>
<div class="outline-text-3" id="text-7-3">
<p>
<a href="https://jmdoudoux.developpez.com/cours/developpons/java/chap-collections.php#collections-5">L'interface Map fait partie d'une hiérarchie de classes</a> et on
l'utilisera à chaque fois que possible, par exemple en écrivant :
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #6434A3;">Map</span>&lt;<span style="color: #6434A3;">String</span>, <span style="color: #6434A3;">Integer</span>&gt; <span style="color: #BA36A5;">stringToInt</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">HashMap</span>&lt;<span style="color: #6434A3;">String</span>, <span style="color: #6434A3;">Integer</span>&gt;();
</pre>
</div>
<p>
ou
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #6434A3;">Map</span>&lt;<span style="color: #6434A3;">String</span>, <span style="color: #6434A3;">Integer</span>&gt; <span style="color: #BA36A5;">stringToInt</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">TreeMap</span>&lt;<span style="color: #6434A3;">String</span>, <span style="color: #6434A3;">Integer</span>&gt;();
</pre>
</div>

<p>
plutôt que :
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #6434A3;">HashMap</span>&lt;<span style="color: #6434A3;">String</span>, <span style="color: #6434A3;">Integer</span>&gt; <span style="color: #BA36A5;">stringToInt</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">HashMap</span>&lt;<span style="color: #6434A3;">String</span>, <span style="color: #6434A3;">Integer</span>&gt;();
</pre>
</div>
<p>
ou
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #6434A3;">TreeMap</span>&lt;<span style="color: #6434A3;">String</span>, <span style="color: #6434A3;">Integer</span>&gt; <span style="color: #BA36A5;">stringToInt</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">TreeMap</span>&lt;<span style="color: #6434A3;">String</span>, <span style="color: #6434A3;">Integer</span>&gt;();
</pre>
</div>
</div>
</div>

<div id="outline-container-org3faaa12" class="outline-3">
<h3 id="org3faaa12"><span class="section-number-3">7.4</span> Collection</h3>
<div class="outline-text-3" id="text-7-4">
<p>
En fait, il y a quelques fonctionnalités qui sont communes à toutes
les structures de données (notamment le fait de pouvoir la parcourir,
savoir si elle est vide ou connaître sa taille). L'interface
<a href="https://docs.oracle.com/javase/8/docs/api/java/util/Collection.html">Collection</a> permet d'exprimer ce niveau d'abstraction. Lorsque cela est
possible, on aura donc intérêt à prendre les arguments en tant que
<a href="https://docs.oracle.com/javase/8/docs/api/java/util/Collection.html">Collection</a> pour avoir le code le plus générique et réutilisable
possible.
</p>
</div>
</div>
</div>
