session1/cours/java_collections.md


<a id="org21144ed"></a>

## List

[L'interface List est implémentée par de nombreuses classes](https://jmdoudoux.developpez.com/cours/developpons/java/chap-collections.php#collections-3) et à chaque fois que possible, on utilisera la classe concrète aussi peu que possible (i.e. à l'instanciation), par exemple en écrivant :

```java
List<String> myStrings = new ArrayList<String>();
```

ou

```java
List<String> myStrings = new LinkedList<String>();
```

plutôt que :

```java
ArrayList<String> myStrings = new ArrayList<String>();
```

ou

```java
LinkedList<String> myStrings = new LinkedList<String>();
```


<a id="orgb31047d"></a>

## Set

[L'interface Set fait partie d'une hiérarchies de classes](https://jmdoudoux.developpez.com/cours/developpons/java/chap-collections.php#collections-4) et on l'utilisera à chaque fois que possible, par exemple en écrivant :

```java
Set<String> myStrings = new HashSet<String>();
```

ou

```java
Set<String> myStrings = new TreeSet<String>();
```

plutôt que :

```java
HashSet<String> myStrings = new HashSet<String>();
```

ou

```java
TreeSet<String> myStrings = new TreeSet<String>();
```


<a id="orgc1efd1d"></a>

## Map

[L'interface Map fait partie d'une hiérarchie de classes](https://jmdoudoux.developpez.com/cours/developpons/java/chap-collections.php#collections-5) et on l'utilisera à chaque fois que possible, par exemple en écrivant :

```java
Map<String, Integer> stringToInt = new HashMap<String, Integer>();
```

ou

```java
Map<String, Integer> stringToInt = new TreeMap<String, Integer>();
```

plutôt que :

```java
HashMap<String, Integer> stringToInt = new HashMap<String, Integer>();
```

ou

```java
TreeMap<String, Integer> stringToInt = new TreeMap<String, Integer>();
```


<a id="orgb6cfcc6"></a>

## Collection

En fait, il y a quelques fonctionnalités qui sont communes à toutes les structures de données (notamment le fait de pouvoir la parcourir, savoir si elle est vide ou connaître sa taille). L'interface [Collection](https://docs.oracle.com/javase/8/docs/api/java/util/Collection.html) permet d'exprimer ce niveau d'abstraction. Lorsque cela est possible, on aura donc intérêt à prendre les arguments en tant que [Collection](https://docs.oracle.com/javase/8/docs/api/java/util/Collection.html) pour avoir le code le plus générique et réutilisable possible.

On peut par exemple parcourir n'importe quelle collection soit [avec un Iterator](https://www.baeldung.com/java-iterator), soit avec la boucle `for( X x : xs)` où `xs` est un `X[]` ou une `Collection<X>`.
